#+TITLE:     Guix: Setup Scimax
#+AUTHOR:    David Conner
#+EMAIL:     aionfork@gmail.com
#+DESCRIPTION: notes
#+property: header-args        :tangle-mode (identity #o640) :mkdirp yes
#+property: header-args:sh     :tangle-mode (identity #o750) :mkdirp yes
#+property: header-args:bash   :tangle-mode (identity #o750) :mkdirp yes


#+BEGIN_QUOTE
TODO: finish notes on setting up scimax
#+END_QUOTE

I want to start working in Jupyter more. I definitely prefer the ZMQ
Kernel workflow, which doesn't require a browser, a localhost port or
restarting server. Lacking Emacs bindings in the browser is not all
that bad -- I have a jupyter cheatsheet for that -- it's when you try
to cut text and close the tab with =C-w= that gets me.

I forked scimax to use it as a second Emacs config. Scimax has a ton
of great features for packages I want to use, like =org-ref= and
=emacs-jupyter=. A well-configured Emacs environment to compare
against tightens your feedback loops so you can more quickly integrate
features into good habits before repetitive reactions become bad
habits. 

Judging from the first ten or so files that scimax loads, Scimax is
written to help teach =emacs-lisp=. Reading through the code and docs
in [[https://github.com/jkitchin/scimax/tree/master/scimax.el][scimax.el]], [[https://github.com/jkitchin/scimax/tree/master/scimax.org][scimax.org]] and [[https://github.com/jkitchin/scimax/tree/master/scimax-notebook.org][scimax-notebook.org]] would be invaluable
for Emacs noobs. The hydras make features and commands discoverable.
The docs drive new users to these in the interface. The keybindings
like =C-M-f= and =M-{= work in most major-mode exactly how you expect,
whether =*-ts-mode= is on. As a new user, you need to learn these
quickly, since the characters they bind to are used as mnemonics for
other packages. All these main navigation commands are covered in a
hydra in =scimax.el= which is great.  I prefer transients once I'm
*** Customizations

#+BEGIN_SRC emacs-lisp
custom-file
#+END_SRC

#+RESULTS:
: ~/.emacs.scimax/user/custom.el

*** Can't connect to ZMQ

For some reason, the kernels are starting, but getting this error.

#+begin_quote
zmq.error.ZMQError: Address already in use (addr='tcp://127.0.0.1:36647')
#+end_quote

The processes don't show in =M-x list-processes=, but the scimax process tree can be shown with

#+begin_src sh
scimax_pid="$(pgrep -fa emacs | grep -e '--with-profile scimax' | tail -n1 | cut -f1 -d' ')"
# pstree $scimax_pid

scimax_pid="$(pgrep -fa emacs | grep -e 'guix shell.*--with-profile scimax' | tail -n1 | cut -f1 -d' ')"
pstree $scimax_pid
# or: to see everything adjacent
# pstree -H $scimax_pid -h
#+end_src

#+RESULTS:
| guix-+-.emacs-29.0.92--+-aspell |   |                     |                 |
|                                 |   |                     | -emacsql-sqlite |
|                                 |   | `-{.emacs-29.0.92-} |                 |
| `-16*[{guix}]                   |   |                     |                 |

However, they're getting forked from =pyenv= but directly from my user's
systemd. They aren't owned by emacs.

#+begin_quote
python3───11*[{python3}]
#+end_quote

